app/controllers/books_controller.rb

INSERT INTO "books" ("author", "created_at", "description", "girl_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(params[:book])
        respond_to do |format|
          if @book.save

SELECT "books".* FROM "books" WHERE "books"."girl_id" = 1
---
  def index
    @books = Book.find_all_by_girl_id(params[:girl_id])